hinoonyaso/coolro/stm32_f103_hal/cubemx/coolro_f103c8.ioc
File.Version=6
GPIO.groupedBy=GroupByPeripherals
KeepUserPlacement=false
Mcu.CPN=STM32F103C8Tx
Mcu.Family=STM32F1
Mcu.IP0=RCC
Mcu.IP1=SYS
Mcu.IP2=USART1
Mcu.IP3=TIM2
Mcu.IP4=GPIO
Mcu.Name=STM32F103C8Tx
Mcu.Package=LQFP48
Mcu.Pin0=PA0
Mcu.Pin1=PA1
Mcu.Pin2=PA9
Mcu.Pin3=PA10
Mcu.Pin4=PB12
Mcu.Pin5=PB13
Mcu.Pin6=PB14
Mcu.Pin7=PB15
Mcu.PinsNb=8
Mcu.UserConstants=
Mcu.UserName=STM32F103C8Tx
MxCube.Version=6.11.1
MxDb.Version=DB.6.0.111
NVIC.PRIORITYGROUP=NVIC_PRIORITYGROUP_4
PA0.Signal=TIM2_CH1
PA1.Signal=TIM2_CH2
PA9.Signal=USART1_TX
PA10.Signal=USART1_RX
PB12.Signal=GPIO_Output
PB13.Signal=GPIO_Output
PB14.Signal=GPIO_Output
PB15.Signal=GPIO_Output
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.Compiler=GCC
ProjectManager.CoupleFile=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32F103C8Tx
ProjectManager.FirmwarePackage=STM32Cube FW_F1 V1.8.4
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=coolro_f103c8
ProjectManager.ProjectName=coolro_f103c8
ProjectManager.ProjectStructure=
ProjectManager.StackSize=0x400
ProjectManager.TargetToolchain=STM32CubeIDE
ProjectManager.ToolChainLocation=
ProjectManager.UnderRoot=false
ProjectManager.UserConstants=
ProjectManager.functionlistsort=
RCC.AHBFreq_Value=72000000
RCC.APB1Freq_Value=36000000
RCC.APB2Freq_Value=72000000
RCC.HSE_VALUE=8000000
RCC.PLLCLKFreq_Value=72000000
RCC.PLLMul=RCC_PLL_MUL9
RCC.SysClockFreq_VALUE=72000000
SYS.Debug=Serial Wire
SYS.TimebaseSource=SysTick
TIM2.Channel-PWM\ Generation1=TIM_CHANNEL_1
TIM2.Channel-PWM\ Generation2=TIM_CHANNEL_2
TIM2.IPParameters=Prescaler,Period
TIM2.Period=999
TIM2.Prescaler=71
USART1.BaudRate=9600
USART1.IPParameters=BaudRate,WordLength,StopBits,Parity,Mode
USART1.Mode=Asynchronous
